zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam0/include/same54/component/picop.h
#define PICOP_OCDCONFIG_OFFSET      0x050        /**< \brief (PICOP_OCDCONFIG offset) OCD Configuration */
#define PICOP_OCDCONFIG_RESETVALUE  0x00000000ul /**< \brief (PICOP_OCDCONFIG reset_value) OCD Configuration */

#define PICOP_OCDCONFIG_CCNTEN_Pos  1            /**< \brief (PICOP_OCDCONFIG) Cycle Counter Enable */
#define PICOP_OCDCONFIG_CCNTEN      (0x1ul << PICOP_OCDCONFIG_CCNTEN_Pos)
#define PICOP_OCDCONFIG_MASK        0x00000002ul /**< \brief (PICOP_OCDCONFIG) MASK Register */

/* -------- PICOP_OCDCONTROL : (PICOP Offset: 0x054) (R/W 32) OCD Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OCDEN:1;          /*!< bit:      0  OCD Enable                         */
    uint32_t :1;               /*!< bit:      1  Reserved                           */
    uint32_t BPSSTEP:1;        /*!< bit:      2  Single Step Breakpoint             */
    uint32_t BPCOF:1;          /*!< bit:      3  Change of Flow Breakpoint          */
    uint32_t BPRST:1;          /*!< bit:      4  Reset Breakpoint                   */
    uint32_t BPEXCEPTION:1;    /*!< bit:      5  Exception Breakpoint               */
    uint32_t BPIRQ:1;          /*!< bit:      6  Interrupt Request Breakpoint       */
    uint32_t BPSW:1;           /*!< bit:      7  Software Breakpoint                */
    uint32_t BPSLEEP:1;        /*!< bit:      8  Sleep Breakpoint                   */
    uint32_t BPWDT:1;          /*!< bit:      9  Watchdog Timer Breakpoint          */
    uint32_t BPISA:1;          /*!< bit:     10  ISA Breakpoint                     */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t BPCOMP:4;         /*!< bit: 12..15  Comparator Breakpoint              */
    uint32_t BPGENMODE:4;      /*!< bit: 16..19  Breakpoint Generator n Mode        */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_OCDCONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_OCDCONTROL_OFFSET     0x054        /**< \brief (PICOP_OCDCONTROL offset) OCD Control */
#define PICOP_OCDCONTROL_RESETVALUE 0x00000000ul /**< \brief (PICOP_OCDCONTROL reset_value) OCD Control */

#define PICOP_OCDCONTROL_OCDEN_Pos  0            /**< \brief (PICOP_OCDCONTROL) OCD Enable */
#define PICOP_OCDCONTROL_OCDEN      (0x1ul << PICOP_OCDCONTROL_OCDEN_Pos)
#define PICOP_OCDCONTROL_BPSSTEP_Pos 2            /**< \brief (PICOP_OCDCONTROL) Single Step Breakpoint */
#define PICOP_OCDCONTROL_BPSSTEP    (0x1ul << PICOP_OCDCONTROL_BPSSTEP_Pos)
#define PICOP_OCDCONTROL_BPCOF_Pos  3            /**< \brief (PICOP_OCDCONTROL) Change of Flow Breakpoint */
#define PICOP_OCDCONTROL_BPCOF      (0x1ul << PICOP_OCDCONTROL_BPCOF_Pos)
#define PICOP_OCDCONTROL_BPRST_Pos  4            /**< \brief (PICOP_OCDCONTROL) Reset Breakpoint */
#define PICOP_OCDCONTROL_BPRST      (0x1ul << PICOP_OCDCONTROL_BPRST_Pos)
#define PICOP_OCDCONTROL_BPEXCEPTION_Pos 5            /**< \brief (PICOP_OCDCONTROL) Exception Breakpoint */
#define PICOP_OCDCONTROL_BPEXCEPTION (0x1ul << PICOP_OCDCONTROL_BPEXCEPTION_Pos)
#define PICOP_OCDCONTROL_BPIRQ_Pos  6            /**< \brief (PICOP_OCDCONTROL) Interrupt Request Breakpoint */
#define PICOP_OCDCONTROL_BPIRQ      (0x1ul << PICOP_OCDCONTROL_BPIRQ_Pos)
#define PICOP_OCDCONTROL_BPSW_Pos   7            /**< \brief (PICOP_OCDCONTROL) Software Breakpoint */
#define PICOP_OCDCONTROL_BPSW       (0x1ul << PICOP_OCDCONTROL_BPSW_Pos)
#define PICOP_OCDCONTROL_BPSLEEP_Pos 8            /**< \brief (PICOP_OCDCONTROL) Sleep Breakpoint */
#define PICOP_OCDCONTROL_BPSLEEP    (0x1ul << PICOP_OCDCONTROL_BPSLEEP_Pos)
#define PICOP_OCDCONTROL_BPWDT_Pos  9            /**< \brief (PICOP_OCDCONTROL) Watchdog Timer Breakpoint */
#define PICOP_OCDCONTROL_BPWDT      (0x1ul << PICOP_OCDCONTROL_BPWDT_Pos)
#define PICOP_OCDCONTROL_BPISA_Pos  10           /**< \brief (PICOP_OCDCONTROL) ISA Breakpoint */
#define PICOP_OCDCONTROL_BPISA      (0x1ul << PICOP_OCDCONTROL_BPISA_Pos)
#define PICOP_OCDCONTROL_BPCOMP_Pos 12           /**< \brief (PICOP_OCDCONTROL) Comparator Breakpoint */
#define PICOP_OCDCONTROL_BPCOMP_Msk (0xFul << PICOP_OCDCONTROL_BPCOMP_Pos)
#define PICOP_OCDCONTROL_BPCOMP(value) (PICOP_OCDCONTROL_BPCOMP_Msk & ((value) << PICOP_OCDCONTROL_BPCOMP_Pos))
#define PICOP_OCDCONTROL_BPGENMODE_Pos 16           /**< \brief (PICOP_OCDCONTROL) Breakpoint Generator n Mode */
#define PICOP_OCDCONTROL_BPGENMODE_Msk (0xFul << PICOP_OCDCONTROL_BPGENMODE_Pos)
#define PICOP_OCDCONTROL_BPGENMODE(value) (PICOP_OCDCONTROL_BPGENMODE_Msk & ((value) << PICOP_OCDCONTROL_BPGENMODE_Pos))
#define PICOP_OCDCONTROL_MASK       0x000FF7FDul /**< \brief (PICOP_OCDCONTROL) MASK Register */

/* -------- PICOP_OCDSTATUS : (PICOP Offset: 0x058) (R/W 32) OCD Status and Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct { // CMD mode
    uint32_t INST:16;          /*!< bit:  0..15  Instruction Override               */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } CMD;                       /*!< Structure used for CMD                          */
  struct { // STATUS mode
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t BPEXT:1;          /*!< bit:      1  External Breakpoint                */
    uint32_t BPSSTEP:1;        /*!< bit:      2  Single Step Breakpoint             */
    uint32_t BPCOF:1;          /*!< bit:      3  Change of Flow Breakpoint          */
    uint32_t BPRST:1;          /*!< bit:      4  Reset Breakpoint                   */
    uint32_t BPEXCEPTION:1;    /*!< bit:      5  Exception Breakpoint               */
    uint32_t BPIRQ:1;          /*!< bit:      6  Interrupt Request Breakpoint       */
    uint32_t BPSW:1;           /*!< bit:      7  Software Breakpoint                */
    uint32_t BPSLEEP:1;        /*!< bit:      8  Sleep Breakpoint                   */
    uint32_t BPWDT:1;          /*!< bit:      9  Watchdog Timer Breakpoint          */
    uint32_t BPISA:1;          /*!< bit:     10  ISA Breakpoint                     */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t BPCOMP:4;         /*!< bit: 12..15  Comparator Breakpoint              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } STATUS;                    /*!< Structure used for STATUS                       */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_OCDSTATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

